app/controllers/appointment_controller.rb

  def index
    user = User.find_by(token: valid_user_params[:token])
    data = {}

    if user
      appointments = Appointment.select(:name, :category, :description, :city, :address, :date, :duration, :price)
        .joins(:user, :body_treatment, :studio, :duration).where(user_id: user.id).order(:date)
---
SELECT "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", "a60901bfc1d8b0462d4de70fb53138c9"], ["LIMIT", 1]]
SELECT "name", "category", "description", "city", "address", "appointments"."date", "duration", "price" FROM "appointments" INNER JOIN "users" ON "users"."id" = "appointments"."user_id" INNER JOIN "body_treatments" ON "body_treatments"."id" = "appointments"."body_treatment_id" INNER JOIN "studios" ON "studios"."id" = "appointments"."studio_id" INNER JOIN "durations" ON "durations"."id" = "appointments"."duration_id" WHERE "appointments"."user_id" = ? ORDER BY "appointments"."date" ASC  [["user_id", 2]]

  def create
    user = User.find_by(token: appointment_params[:token])
    data = {}

    if user
      body_treatment = BodyTreatment.find_by(name: appointment_params[:service],
                                             category: appointment_params[:category])
      studio = Studio.find_by(city: appointment_params[:city], address: appointment_params[:address])

      location = Location.find_by(studio_id: studio.id, body_treatment_id: body_treatment.id)
      duration = Duration.find_by(body_treatment_id: body_treatment.id,
                                  duration: appointment_params[:duration])

      if location && duration
        Appointment.create(user_id: user.id, body_treatment_id: body_treatment.id,
                           studio_id: studio.id, duration_id: duration.id, date: appointment_params[:date])
---
SELECT "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", "6ca457c76e6de80e7fb14dc6ee743b69"], ["LIMIT", 1]]
SELECT "body_treatments".* FROM "body_treatments" WHERE "body_treatments"."name" = ? AND "body_treatments"."category" = ? LIMIT ?  [["name", "Full Body Massage"], ["category", "Massage"], ["LIMIT", 1]]
SELECT "studios".* FROM "studios" WHERE "studios"."city" = ? AND "studios"."address" = ? LIMIT ?  [["city", "Seattle"], ["address", "Heaven Street 7 - 11"], ["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."studio_id" = ? AND "locations"."body_treatment_id" = ? LIMIT ?  [["studio_id", 1], ["body_treatment_id", 1], ["LIMIT", 1]]
SELECT "durations".* FROM "durations" WHERE "durations"."body_treatment_id" = ? AND "durations"."duration" = ? LIMIT ?  [["body_treatment_id", 1], ["duration", 30], ["LIMIT", 1]]
INSERT INTO "appointments" ("user_id", "body_treatment_id", "studio_id", "duration_id", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 2], ["body_treatment_id", 1], ["studio_id", 1], ["duration_id", 1], ["date", "2020-07-02"], ["created_at", "2020-06-03 15:21:14.148089"], ["updated_at", "2020-06-03 15:21:14.148089"]]