app/controllers/body_treatment_controller.rb

SELECT "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", "1696e4846f160b5a4ed7274dbe81043d"], ["LIMIT", 1]]
SELECT "body_treatments"."name", "body_treatments"."category", "body_treatments"."description", "city", "address", "duration", "price" FROM "body_treatments" INNER JOIN "locations" ON "locations"."body_treatment_id" = "body_treatments"."id" INNER JOIN "studios" ON "studios"."id" = "locations"."studio_id" INNER JOIN "durations" ON "durations"."body_treatment_id" = "body_treatments"."id" ORDER BY "body_treatments"."name" ASC, "city" ASC, "address" ASC, "duration" ASC
---
  def index
    user = User.find_by(token: valid_user_params[:token])
    data = {}

    if user
      treatments_query = BodyTreatment.select(:name, :category, :description, :city, :address, :duration, :price)
        .joins(:studios, :durations).all.order(:name, :city, :address, :duration)