app/controllers/studio_controller.rb

  def index
    user = User.find_by(token: valid_user_params[:token])
    data = {}

    if user
      data['studios'] = Studio.all
---
SELECT "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", ""], ["LIMIT", 1]]
SELECT "studios".* FROM "studios"