app/controllers/user_controller.rb

INSERT INTO "users" ("firstname", "lastname", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.new(user_params)
    data = {}

    if user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "jane.doe@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", "4e91422dfb2ca500a2f917edb898bfc2"], ["updated_at", "2020-05-28 10:05:35.658609"], ["id", 1]]
---
  def login
    user = User.find_by_email(login_params[:email])
    data = {}

    if user&.authenticate(login_params[:password])
      user.update(token: SecureRandom.hex(16))

SELECT "users".* FROM "users" WHERE "users"."token" = ? LIMIT ?  [["token", "46cf02abf09f0e2f47b140a4634cdf01"], ["LIMIT", 1]]
UPDATE "users" SET "token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", nil], ["updated_at", "2020-05-28 10:10:19.693312"], ["id", 1]]
---
  def logout
    user = User.find_by(token: logout_params[:token])
    data = { 'loggedIn' => false }

    user&.update(token: nil)